text ="""
পাঠকদের উদ্দেশ্যে একটি পত্রিকার সম্পাদকীয় নোট, যেখানে পত্রিকার প্রকাশনা প্রসঙ্গ, লেখকদের উল্লেখ, বই প্রকাশের তথ্য এবং জাপানে পারমাণবিক বিপর্যয় নিয়ে উদ্বেগ প্রকাশ করা হয়েছে।

আমাদের কথা  
অশোক বন্দ্যোপাধ্যায়  
শ্যামল চক্রবর্তী  
বিবেক দেবরায়  
শুভেন্দু দাশগুপ্ত  
অরবিন্দ গুপ্ত  
দিব্যস দাশ  
জয়ন্ত দাস  
সমীরকুমার ঘোষ  
সুজয় বসু  
রুচিরাম সাহানী  

সূচিপত্র  
বিষয়  
লেখক  
পৃষ্ঠা  

আমাদের কথা  
আত্মবিশ্বাস  
বিকাশের উৎস যাই  
হোক উদ্দেশ্য মানুষ  
আমাদের এখানে চাষ  
এখনো গেল না আঁধার  
পত্রিকায় সাম্প্রদায়িকতা  
প্রাক স্বাধীনতা বাংলা  
পাউডার ও ঘামাচির কথা  
জাপানে ভূমিকম্প  
O পরমাণু কেন্দ্রে দুর্ঘটনা  
চিঠিপত্র  
পুস্তক পরিচিতি  

এপ্রিল-জুন ২০১১  
সংখ্যা  

আমরা যে গুটিকয় বুড়ো ঘোড়া পত্রিকাটিকে চালিয়ে নিয়ে যাওয়ার চেষ্টা করছি, দু বছরের প্রকাশ তাদের বুড়ো হাড়ে ভেলকি না হলেও কিঞ্চিৎ শক্তি জোগাচ্ছে। আর তারই জোরে বহুদিনের চাহিদা 'বিবেককান্দ অনা চোখে' এবং 'এটা কী ওটা কেন' বই দুটি ছাপানো গেছে। কাজ চলছে 'শেকল ভাঙা সংস্কৃতি'র পুনর্মুদ্রণের। অশোকদার ছড়িয়ে-ছিটিয়ে থাকা লেখাগুলো নিয়ে সঙ্কলন প্রকাশের সঙ্কল্প এখনও ত্যাগ করিনি। পপিকার পাতায় সেগুলো ছাপানোর মাধ্যমে তারই সূত্রে পাকানো শুরু হল।  

২০০৯ এবং ২০১০—দুটো বছর তিনটে করে সংখ্যা প্রকাশের পর, ২০১১-এর জানুয়ারি মাসেও একটি সংখ্যা প্রকাশিত হয়েছে। শুরুর সংশয়, সন্দেহ কাটিয়ে মোটামুটি একটা ধারাবাহিকতা আমরা বজায় রাখতে পেরেছি। পুরনো বন্ধুবান্ধব, পাঠকেরা উৎসাহ দিচ্ছেন। তার জোরেই ঠিক হয়েছে বছরে চারটে করে সংখ্যা প্রকাশিত হবে। যাঁরা পত্রিকা হাতে পাচ্ছেন, তাঁরা অন্যকে জানিয়ে দিন 'উৎস মানুষ' এখনও বেঁচে-বর্তে আছে। প্রয়াত অশোক বন্দ্যোপাধ্যায়ের যে সব 'ভক্ত' বর্তমানে প্রকাশিত 'উৎস মানুষ' পত্রিকাকে প্রকাশ বলেই ধরছেন না, তাঁদের কথা আলাদা।  

পাঠকেরা খুশি হবেন—বহুদিন পরে বিবেক দেবরায়, শুভেন্দু দাশগুপ্তের মতো পুরনো বন্ধুদের লেখা পাওয়া গিয়েছে। ইতিমধ্যে সুনামি-ধ্বস্ত জাপানে পারমাণবিক চুল্লিতে বিপর্যয় পুরনো আশঙ্কাকেই প্রমাণ করে দিয়েছে। সলিল, নিরাপদ 'শক্তির বেলুনটি গিয়েছে ফেঁসে। একেসাথে রেখেই আমাদের প্রতিবাদী কণ্ঠগুলোকে আরও উচ্চকিত করে তুলতে হবে, যাতে আর কোথাও না এভাবে বেঘোরে প্রাণ দিতে হয় মানুষের।  

রেজিস্টার্ড অফিস—বিডি ৪৯৪ সল্টলেক, কলকাতা-৭০০০৬৪  
কার্যালয়—খাদিমস, বিদ্যাকুট আবাসন, বি-৪, ৫৫এস-৩, নারায়ণপুর, পোঃ (আর) গোপালপুর, কলকাতা-৭০০১৩৬  
ফোন: ৯৮৩০৬৫৯০৫৮, ৯৪৩৮৮৮৮৬২, ৯৮৩৪৬১৪৫৬  
ওয়েবসাইট: www.utsamanush1.com  
ই-মেল: utsamanush11980@gmail.com, utsamanush11980@gmail.com  
সম্পাদকমণ্ডলী
"""

from bangla_tts import generate

# single sentence
file_paths = generate(["আমার সোনার বাংলা আমি তোমাকে ভালোবাসি"], save_path="out_dir")
print(file_paths)

# or get numpy signals
audio_signals = generate(["আমি বাংলায় কথা বলি"])
signal, sr = audio_signals[0]
